#ifndef __BEEP_H_
#define __BEEP_H_

#include "sys.h"

/***********************************************************************/
//BEEP驱动程序(通用易移植版)
//此程序适用于七彩光子太极M3—STM32F103开发板及部分兼容的STM32系统，
//只供学习使用，未经作者许可，不得用于其它任何用途！
/***********************************************************************/	 



/***************** 蜂鸣器所在GPIO口时钟宏定义 ***************************/
#define BEEP_GPIO_RCC_CLK  RCC_APB2Periph_GPIOB//BEEP GPIO RCC时钟
/****************************** end *********************************/


/********************* 蜂鸣器所在GPIO口宏定义 ***************************/
#define BEEP_GPIO  GPIOB

#define BEEP_PIN   GPIO_Pin_8

#define BEEP PBout(8)     // PB8
/****************************** end *********************************/


/************** 蜂鸣器操作函数宏定义(高电平打开) *********************/
#define BEEP_ON()      BEEP=1    //打开蜂鸣器
#define BEEP_OFF()     BEEP=0    //关闭蜂鸣器
#define BEEP_TOGGLE()  BEEP^=1   //翻转蜂鸣器
/****************************** end *********************************/


/*************************** 调用说明 *******************************/
//  1、引用beep.h头文件
//  2、调用初始化函数
//  3、使用宏定义操作蜂鸣器
//  示例:
//      BEEP_ON();      //打开BEEP
//      BEEP_OFF();     //关闭BEEP
//      BEEP_TOGGLE();  //翻转BEEP
/****************************** end *********************************/




/************************* 函数声明 *********************************/
void Beep_Init(void);//初始化


/****************************** end *********************************/






		 				    
#endif
